/********************************** (C) COPYRIGHT *********************************
* File Name          : CH395.C
* Author             : tech10
* Version            : V1.0
* Date               : 2014/1/1
* Description        : CH395功能演示
**********************************************************************************/
/**********************************************************************************
CH395 TCP/IP 协议族接口
STM32 演示程序，用于演示Socket0工作在TCP Server模式下，单片机收到数据后回传。
**********************************************************************************/
/* 头文件包含*/
#include <stm32f10x_lib.h>              /* STM32F10x库定义 */
#include <string.h>
#include "../system/system.h"
#include "string.h"
#include "stdio.h"
#include "../PUB/CH395inc.h"
//#include "CH395.H"



/**********************************************************************************
* Function Name  : main
* Description    : main主函数
* Input          : None
* Output         : None
* Return         : None
**********************************************************************************/
int main(void)
{
    UINT8 i; 
    System_Initialization();
}

/****************************endfile@tech9*************************************/
